WfHit/wheel_loader/platforms/nuttx/src/px4/stm/stm32_common/qencoder/quad_encoder.c
/****************************************************************************
 *
 *   Copyright (c) 2025 PX4 Development Team. All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name PX4 nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <sys/types.h>
#include <stdio.h>
#include <string.h>
#include <syslog.h>
#include <errno.h>

#include "stm32_gpio.h"
#include <px4_arch/quad_encoder.h>
#include <px4_arch/nuttx_qencoder.h>

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: qencoder_gpio_config
 *
 * Description:
 *   Configure GPIO pins for index signals
 *
 ****************************************************************************/

static void qencoder_gpio_config(FAR const struct nuttx_qe_config_s *configs,
                                unsigned count)
{
  /* Configure index pins as GPIO inputs for encoders */
  for (unsigned int i = 0; i < count; i++)
    {
      if (configs[i].use_index && configs[i].gpio.index != 0)
        {
          /* Configure index pin as input with pull-up */
          stm32_configgpio(configs[i].gpio.index | GPIO_INPUT | GPIO_PULLUP);
        }
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: px4_arch_quad_encoder_initialize
 *
 * Description:
 *   Initialize quadrature encoders from board configuration
 *
 ****************************************************************************/

int px4_arch_quad_encoder_initialize(FAR const struct nuttx_qe_config_s *configs,
                                    unsigned count)
{
  int ret;
  char devpath[16];

  if (!configs || count == 0) {
    return -EINVAL;
  }

  syslog(LOG_INFO, "Initializing %u quadrature encoders\n", count);

  /* Configure GPIO pins */
  qencoder_gpio_config(configs, count);

  /* Initialize each encoder */
  for (unsigned int i = 0; i < count; i++)
    {
      snprintf(devpath, sizeof(devpath), "/dev/qe%u", i);

      ret = nuttx_qencoder_initialize(&configs[i], devpath);
      if (ret < 0)
        {
          syslog(LOG_ERR, "ERROR: Failed to initialize encoder %s: %d\n",
                 devpath, ret);
          return ret;
        }

      syslog(LOG_INFO, "Initialized encoder %s (mode=GPIO, resolution=%lu)\n",
             devpath, (unsigned long)configs[i].resolution);
    }

  syslog(LOG_INFO, "All encoders initialized successfully\n");
  return OK;
}

/****************************************************************************
 * Name: px4_arch_quad_encoder_uninitialize_all
 *
 * Description:
 *   Uninitialize all active quadrature encoder instances
 *
 ****************************************************************************/

int px4_arch_quad_encoder_uninitialize_all(void)
{
  return nuttx_qencoder_uninitialize_all();
}
